<?php



switch ($text) {
	case 'Центральный':
       $keyboard = [
    ['Белгородская','Брянская'],
    ['Владимирская','Воронежская'],
    ['Ивановская', 'Калужская'],
    ['Костромская', 'Курская'],
    ['Липецкая', 'Москва'],
    ['Московская обл', 'Орловская'],
    ['Рязанская', 'Смоленская'],
    ['Тамбовская', 'Тверская'],
    ['Тульская', 'Ярославская'],
];

        break;
    case 'Северо-Западный':
               $keyboard = [
    ['Архангельская','Вологодская'],
    ['Калининградская', 'Карелия'],
    ['Коми', 'Ленинградская'],
    ['Мурманская', 'Ненецкий АО'],
    ['Новгородская', 'Псковская'],
    ['Санкт-Петербург'],
];

        break;
    case 'Северо-Кавказский':
                  $keyboard = [
    ['Дагестан','Ингушетия'],
    ['Кабардино-Балкария','Карачаево-Черкессия'],
    ['Северная Осетия — Алания', 'Ставропольский край'],
    ['Чечня'],
];    			
    	break;
    case 'Южный':
                  $keyboard = [
    ['Адыгея','	Астраханская'],
    ['Волгоградская','Калмыкия'],
    ['Краснодарский край', 'Ростовская'],
    ['Крым', 'Севастополь'],
];

        break;
    case 'Приволжский':
         $keyboard = [
    ['Башкортостан','Кировская'],
    ['Марий Эл','Мордовия'],
    ['Нижегородская', 'Оренбургская'],
    ['Пензенская', 'Пермский'],
    ['Самарская', 'Саратовская'],
    ['Татарстан', 'Удмуртия'],
    ['Ульяновская', 'Чувашия'],
];
        break;
    case 'Уральский':
         $keyboard = [
    ['Курганская','Свердловская'],
    ['Тюменская','Ханты-Мансийский АО — Югра'],
    ['Челябинская', 'Ямало-Ненецкий АО'],
    
];
        break;
    case 'Сибирский':
        $keyboard = [
    ['Республика Алтай','Алтайский край'],
    ['Иркутская','Кемеровская — Кузбасс'],
    ['Красноярский край', 'Новосибирская'],
    ['Омская', 'Томская'],
    ['Тыва', 'Хакасия'],
    
];
        break;
    case 'Дальневосточный':
         $keyboard = [
    ['Амурская','Бурятия'],
    ['Еврейская АО','Забайкальский'],
    ['Камчатский край', 'Магаданская область'],
    ['Приморский край', 'Республика Саха (Якутия)'],
    ['Сахалинская', 'Хабаровский край'],
    ['Чукотский АО'],
    
];
        break;
  

};




$resp = array("keyboard" => $keyboard, "resize_keyboard" => true, "one_time_keyboard" => true); 

$reply = json_encode($resp);

sendRequest('sendMessage',['chat_id'=>$id_chat, 'text'=>"Отлично! Выберите Ваш регион", "reply_markup" =>$reply]);

db_update_lvl($db_id, 2);

echo 'done pt1';
?>